CaseLabGreenatom/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.РеквизитыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаБезНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.РеквизитыОрганизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CaseLabGreenatom/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/Documents/УстановкаЦен/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ТекущийСотрудникСервер.СотрудникТекущегоПользователя();	
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = "УЦ";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Согласовано = Ложь Тогда
		
		Отказ = Истина;
		Сообщить("Необходимо согласовать документ перед проведением!");
		
	КонецЕсли;
	
	Для Каждого Строка Из Цены Цикл
		
		ПовторяющиесяСтроки = Цены.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));
		
		Если ПовторяющиесяСтроки.Количество() > 1 Тогда
			
			Отказ = Истина;
			
			Сообщить(СтрШаблон("Имеются повторяющиеся позиции номенклатуры %1. Удалите!", Строка.Номенклатура));
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Цены
	Движения.Цены.Очистить();
	
	Движения.Цены.Записывать = Истина;

	Для Каждого ТекСтрокаЦены Из Цены Цикл
		
		Если ТекСтрокаЦены.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			
			СтавкаНДС = 0;
			
		ИначеЕсли ТекСтрокаЦены.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
			
			СтавкаНДС = 10;
			
		ИначеЕсли ТекСтрокаЦены.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
			
			СтавкаНДС = 20;
			
		КонецЕсли;

		СуммаНДС = Окр(ТекСтрокаЦены.ЦенаБезНДС * СтавкаНДС / 100, 2);
		
		Движение = Движения.Цены.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
		Движение.ЦенаБезНДС = ТекСтрокаЦены.ЦенаБезНДС;
		Движение.СтавкаНДС = ТекСтрокаЦены.СтавкаНДС;
		Движение.ЦенаСНДС = ТекСтрокаЦены.ЦенаБезНДС + СуммаНДС;
		Движение.СуммаНДС = СуммаНДС;
		Движение.Контрагент = Контрагент;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
